src/test/resources/subscriptionChargeCompleted.json

{
  "id": "R4jhTS-iQJuF9TMBRBzjJg",
  "processed": false,
  "created": 1554091889623,
  "type": "subscription.charge.completed",
  "live": false,
  "data": {
    "order": {
      "order": "f4AD0ASGT-aLxvCgZhwqYQ",
      "id": "f4AD0ASGT-aLxvCgZhwqYQ",
      "reference": "FUR190114-3398-66103B",
      "buyerReference": null,
      "completed": true,
      "changed": 1547509655131,
      "changedValue": 1547509655131,
      "changedInSeconds": 1547509655,
      "changedDisplay": "1/14/19",
      "language": "en",
      "live": false,
      "currency": "USD",
      "payoutCurrency": "USD",
      "invoiceUrl": "https://furiousfalcon.onfastspring.com/account/order/FUR190114-3398-66103B/invoice",
      "account": "N8FjcSWcQNeYCc-suM1O8g",
      "total": 14.95,
      "totalDisplay": "$14.95",
      "totalInPayoutCurrency": 14.95,
      "totalInPayoutCurrencyDisplay": "$14.95",
      "tax": 0,
      "taxDisplay": "$0.00",
      "taxInPayoutCurrency": 0,
      "taxInPayoutCurrencyDisplay": "$0.00",
      "subtotal": 14.95,
      "subtotalDisplay": "$14.95",
      "subtotalInPayoutCurrency": 14.95,
      "subtotalInPayoutCurrencyDisplay": "$14.95",
      "discount": 0,
      "discountDisplay": "$0.00",
      "discountInPayoutCurrency": 0,
      "discountInPayoutCurrencyDisplay": "$0.00",
      "discountWithTax": 0,
      "discountWithTaxDisplay": "$0.00",
      "discountWithTaxInPayoutCurrency": 0,
      "discountWithTaxInPayoutCurrencyDisplay": "$0.00",
      "billDescriptor": "FS* fsprg.com",
      "payment": {
        "type": "test"
      },
      "customer": {
        "first": "Leeroy",
        "last": "Jenkins",
        "email": "ne1@all.com",
        "company": "Chicken Danger, Inc.",
        "phone": null
      },
      "address": {
        "city": "Santa Barbara",
        "regionCode": "CA",
        "regionDisplay": "California",
        "region": "California",
        "postalCode": "93101",
        "country": "US",
        "display": "Santa Barbara, California, 93101, US"
      },
      "recipients": [
        {
          "recipient": {
            "first": "Leeroy",
            "last": "Jenkins",
            "email": "ne1@all.com",
            "company": "Chicken Danger, Inc.",
            "phone": null,
            "account": "N8FjcSWcQNeYCc-suM1O8g",
            "address": {
              "city": "Santa Barbara",
              "regionCode": "CA",
              "regionDisplay": "California",
              "region": "California",
              "postalCode": "93101",
              "country": "US",
              "display": "Santa Barbara, California, 93101, US"
            }
          }
        }
      ],
      "notes": [],
      "items": [
        {
          "product": "radar-monthly",
          "quantity": 1,
          "display": "Radar Monthly Subscription",
          "sku": null,
          "subtotal": 14.95,
          "subtotalDisplay": "$14.95",
          "subtotalInPayoutCurrency": 14.95,
          "subtotalInPayoutCurrencyDisplay": "$14.95",
          "discount": 0,
          "discountDisplay": "$0.00",
          "discountInPayoutCurrency": 0,
          "discountInPayoutCurrencyDisplay": "$0.00",
          "subscription": "D6_GWaK_TNKimir8D9hE2w",
          "fulfillments": {}
        }
      ]
    },
    "currency": "USD",
    "total": 14.95,
    "status": "successful",
    "timestamp": 1547509653577,
    "timestampValue": 1547509653577,
    "timestampInSeconds": 1547509653,
    "timestampDisplay": "1/14/19",
    "sequence": 2,
    "periods": null,
    "account": {
      "id": "N8FjcSWcQNeYCc-suM1O8g",
      "account": "N8FjcSWcQNeYCc-suM1O8g",
      "contact": {
        "first": "Leeroy",
        "last": "Jenkins",
        "email": "ne1@all.com",
        "company": "Chicken Danger, Inc.",
        "phone": null
      },
      "language": "en",
      "country": "US",
      "lookup": {
        "global": "TVWhu0iwQhKJyuhpT_2yMw"
      },
      "url": "https://furiousfalcon.onfastspring.com/account"
    },
    "subscription": {
      "id": "D6_GWaK_TNKimir8D9hE2w",
      "subscription": "D6_GWaK_TNKimir8D9hE2w",
      "active": true,
      "state": "active",
      "changed": 1547052708104,
      "changedValue": 1547052708104,
      "changedInSeconds": 1547052708,
      "changedDisplay": "1/9/19",
      "live": false,
      "currency": "USD",
      "account": "N8FjcSWcQNeYCc-suM1O8g",
      "product": "radar-monthly",
      "sku": null,
      "display": "Radar Monthly Subscription",
      "quantity": 1,
      "adhoc": false,
      "autoRenew": true,
      "price": 14.95,
      "priceDisplay": "$14.95",
      "priceInPayoutCurrency": 14.95,
      "priceInPayoutCurrencyDisplay": "$14.95",
      "discount": 0,
      "discountDisplay": "$0.00",
      "discountInPayoutCurrency": 0,
      "discountInPayoutCurrencyDisplay": "$0.00",
      "subtotal": 14.95,
      "subtotalDisplay": "$14.95",
      "subtotalInPayoutCurrency": 14.95,
      "subtotalInPayoutCurrencyDisplay": "$14.95",
      "next": 1552089600000,
      "nextValue": 1552089600000,
      "nextInSeconds": 1552089600,
      "nextDisplay": "3/9/19",
      "end": null,
      "endValue": null,
      "endInSeconds": null,
      "endDisplay": null,
      "canceledDate": null,
      "canceledDateValue": null,
      "canceledDateInSeconds": null,
      "canceledDateDisplay": null,
      "deactivationDate": null,
      "deactivationDateValue": null,
      "deactivationDateInSeconds": null,
      "deactivationDateDisplay": null,
      "sequence": 2,
      "periods": null,
      "remainingPeriods": null,
      "begin": 1546992000000,
      "beginValue": 1546992000000,
      "beginInSeconds": 1546992000,
      "beginDisplay": "1/9/19",
      "intervalUnit": "month",
      "intervalLength": 1,
      "nextChargeCurrency": "USD",
      "nextChargeDate": 1552089600000,
      "nextChargeDateValue": 1552089600000,
      "nextChargeDateInSeconds": 1552089600,
      "nextChargeDateDisplay": "3/9/19",
      "nextChargePreTax": 14.95,
      "nextChargePreTaxDisplay": "$14.95",
      "nextChargePreTaxInPayoutCurrency": 14.95,
      "nextChargePreTaxInPayoutCurrencyDisplay": "$14.95",
      "nextChargeTotal": 14.95,
      "nextChargeTotalDisplay": "$14.95",
      "nextChargeTotalInPayoutCurrency": 14.95,
      "nextChargeTotalInPayoutCurrencyDisplay": "$14.95",
      "nextNotificationType": "PAYMENT_REMINDER",
      "nextNotificationDate": 1551484800000,
      "nextNotificationDateValue": 1551484800000,
      "nextNotificationDateInSeconds": 1551484800,
      "nextNotificationDateDisplay": "3/2/19",
      "paymentReminder": {
        "intervalUnit": "day",
        "intervalLength": 7
      },
      "paymentOverdue": {
        "intervalUnit": "day",
        "intervalLength": 7,
        "total": 2,
        "sent": 0
      },
      "cancellationSetting": {
        "cancellation": "AFTER_LAST_NOTIFICATION",
        "intervalUnit": "week",
        "intervalLength": 2
      },
      "instructions": [
        {
          "product": "radar-monthly",
          "type": "regular",
          "periodStartDate": null,
          "periodStartDateValue": null,
          "periodStartDateInSeconds": null,
          "periodStartDateDisplay": null,
          "periodEndDate": null,
          "periodEndDateValue": null,
          "periodEndDateInSeconds": null,
          "periodEndDateDisplay": null,
          "intervalUnit": "month",
          "intervalLength": 1,
          "discountPercent": 0,
          "discountPercentValue": 0,
          "discountPercentDisplay": "0%",
          "discountTotal": 0,
          "discountTotalDisplay": "$0.00",
          "discountTotalInPayoutCurrency": 0,
          "discountTotalInPayoutCurrencyDisplay": "$0.00",
          "unitDiscount": 0,
          "unitDiscountDisplay": "$0.00",
          "unitDiscountInPayoutCurrency": 0,
          "unitDiscountInPayoutCurrencyDisplay": "$0.00",
          "price": 14.95,
          "priceDisplay": "$14.95",
          "priceInPayoutCurrency": 14.95,
          "priceInPayoutCurrencyDisplay": "$14.95",
          "priceTotal": 14.95,
          "priceTotalDisplay": "$14.95",
          "priceTotalInPayoutCurrency": 14.95,
          "priceTotalInPayoutCurrencyDisplay": "$14.95",
          "unitPrice": 14.95,
          "unitPriceDisplay": "$14.95",
          "unitPriceInPayoutCurrency": 14.95,
          "unitPriceInPayoutCurrencyDisplay": "$14.95",
          "total": 14.95,
          "totalDisplay": "$14.95",
          "totalInPayoutCurrency": 14.95,
          "totalInPayoutCurrencyDisplay": "$14.95"
        }
      ]
    }
  }
}